#+SEQ_TODO: urgent(u) PROJ(p) STARTED(s)  NEXT(n) TODO(t)  MIDWAY(m) WAITING(w) SOMEDAY(h)  | DONE(d) DEFERRED(l) CANCELLED(c)
#+ATTR_ORG: :width 200/250/300/400/500/600
#+ATTR_LATEX: :width 2.0in
#+Attr_HTML: :width 200/250/300/400/500/600px
*** org-tree-to-indirect-buffer
    https://stackoverflow.com/questions/6464738/how-can-i-switch-focus-after-buffer-split-in-emacs
    #+begin_src elisp
      (global-set-key (kbd "C-x 5 t") (lambda ()
                                        (interactive)
                                        (progn
                                          (org-tree-to-indirect-buffer)
                                          (other-window 1)
                                          (spacemacs/toggle-maximize-buffer))))
    #+end_src

    #+RESULTS:
    | lambda | nil | (interactive) | (progn (org-tree-to-indirect-buffer) (other-window 1) (spacemacs/toggle-maximize-buffer)) |

**** doomline
     - link :: https://github.com/seagle0128/doom-modeline
     #+BEGIN_SRC elisp :tangle yes
       (require 'doom-modeline)
       (doom-modeline-mode 1)
     #+end_src
     #+begin_src elisp :tangle yes
       (use-package doom-modeline
         :ensure t
         :hook (after-init . doom-modeline-mode))
     #+end_src

     #+RESULTS:
     | x-wm-set-size-hint | doom-modeline-mode | table--make-cell-map |
*** Hybrid
    The hybrid editing style is like the Vim style except that =insert state= is
    replaced by a new state called =hybrid state=. In =hybrid state= all the Emacs
    key bindings are available; this is like replacing the =insert state= with the
    =emacs state= but provides an isolated key map =evil-hybrid-state-map=.

    To bind keys in Hybrid editing style (=hybrid state=):

    #+BEGIN_SRC emacs-lisp
      (define-key evil-hybrid-state-map (kbd "C-]") 'forward-char)
    #+END_SRC

    This style can be tweaked to be more like Emacs or more like Vim depending
    on the user preferences. The following variables are available to change the
    style configuration:

    - =hybrid-mode-default-state= The default state when opening a new buffer,
      default is =normal=. Set it to =emacs= for a more emacsy style.
    - =hybrid-mode-enable-hjkl-bindings= If non nil then packages will configure
      =h j k l= key bindings for navigation.
    - =hybrid-mode-enable-evilified-state= If non nil buffer are =evilified= when
      supported, if nil then =emacs= state is enabled in those buffers instead.

    Default configuration is:

    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq-default dotspacemacs-editing-style '(hybrid :variables
                                                        hybrid-mode-enable-evilified-state t
                                                        hybrid-mode-enable-hjkl-bindings t
                                                        hybrid-mode-default-state 'normal))
    #+END_SRC

    #+RESULTS:
    | hybrid | :variables | hybrid-mode-enable-evilified-state | t | hybrid-mode-enable-hjkl-bindings | t | hybrid-mode-default-state | (quote normal) |

    To toggle the hybrid style on and off use ~SPC t E h~ and ~M-m t E h~. When
    off the =vim= style is enabled.

*** youtube preview images (inline stuff)
    :PROPERTIES:
    :headers-args: :tangle no
    :END:
    https://emacs.stackexchange.com/questions/38098/org-mode-custom-youtube-link-syntax
    #+begin_src elisp 
      (require 'org)
      (require 'org-element)

      (defcustom org-yt-url-protocol "yt"
        "Protocol identifier for youtube links."
        :group 'org-yt
        :type 'string)

      (defun org-yt-follow (video-id)
        "Open youtube with VIDEO-ID."
        (browse-url (concat "https://youtu.be/" video-id)))

      (org-link-set-parameters org-yt-url-protocol :follow #'org-yt-follow)

      (defun org-image-update-overlay (file link &optional data-p refresh)
        "Create image overlay for FILE associtated with org-element LINK.
              If DATA-P is non-nil FILE is not a file name but a string with the image data.
              See also `create-image'.
              This function is almost a duplicate of a part of `org-display-inline-images'."
        (when (or data-p (file-exists-p file))
          (let ((width
                 ;; Apply `org-image-actual-width' specifications.
                 (cond
                  ((not (image-type-available-p 'imagemagick)) nil)
                  ((eq org-image-actual-width t) nil)
                  ((listp org-image-actual-width)
                   (or
                    ;; First try to find a width among
                    ;; attributes associated to the paragraph
                    ;; containing link.
                    (let ((paragraph
                           (let ((e link))
                             (while (and (setq e (org-element-property
                                                  :parent e))
                                         (not (eq (org-element-type e)
                                                  'paragraph))))
                             e)))
                      (when paragraph
                        (save-excursion
                          (goto-char (org-element-property :begin paragraph))
                          (when
                              (re-search-forward
                               "^[ \t]*#\\+attr_.*?: +.*?:width +\\(\\S-+\\)"
                               (org-element-property
                                :post-affiliated paragraph)
                               t)
                            (string-to-number (match-string 1))))))
                    ;; Otherwise, fall-back to provided number.
                    (car org-image-actual-width)))
                  ((numberp org-image-actual-width)
                   org-image-actual-width)))
                (old (get-char-property-and-overlay
                      (org-element-property :begin link)
                      'org-image-overlay)))
            (if (and (car-safe old) refresh)
                (image-refresh (overlay-get (cdr old) 'display))
              (let ((image (create-image file
                                         (and width 'imagemagick)
                                         data-p
                                         :width width)))
                (when image
                  (let* ((link
                          ;; If inline image is the description
                          ;; of another link, be sure to
                          ;; consider the latter as the one to
                          ;; apply the overlay on.
                          (let ((parent
                                 (org-element-property :parent link)))
                            (if (eq (org-element-type parent) 'link)
                                parent
                              link)))
                         (ov (make-overlay
                              (org-element-property :begin link)
                              (progn
                                (goto-char
                                 (org-element-property :end link))
                                (skip-chars-backward " \t")
                                (point)))))
                    (overlay-put ov 'display image)
                    (overlay-put ov 'face 'default)
                    (overlay-put ov 'org-image-overlay t)
                    (overlay-put
                     ov 'modification-hooks
                     (list 'org-display-inline-remove-overlay))
                    (push ov org-inline-image-overlays))))))))

      (defun org-yt-get-image (url)
        "Retrieve image from url."
        (let ((image-buf (url-retrieve-synchronously url)))
          (when image-buf
            (with-current-buffer image-buf
              (goto-char (point-min))
              (when (looking-at "HTTP/")
                (delete-region (point-min)
                               (progn (re-search-forward "\n[\n]+")
                                      (point))))
              (setq image-data (buffer-substring-no-properties (point-min) (point-max)))))))

      (defconst org-yt-video-id-regexp "[-_[:alnum:]]\\{10\\}[AEIMQUYcgkosw048]"
        "Regexp matching youtube video id's taken from `https://webapps.stackexchange.com/questions/54443/format-for-id-of-youtube-video'.")

      (defun org-yt-display-inline-images (&optional include-linked refresh beg end)
        "Like `org-display-inline-images' but for yt-links."
        (when (display-graphic-p)
          (org-with-wide-buffer
           (goto-char (or beg (point-min)))
           (let ((re (format "\\[\\[%s:\\(%s\\)\\]\\]" org-yt-url-protocol org-yt-video-id-regexp)))
             (while (re-search-forward re end t)
               (let ((video-id (match-string 1))
                     (el (save-excursion (goto-char (match-beginning 1)) (org-element-context)))
                     image-data)
                 (when el
                   (setq image-data 
                         (or (let ((old (get-char-property-and-overlay
                                         (org-element-property :begin el)
                                         'org-image-overlay)))
                               (and old
                                    (car-safe old)
                                    (overlay-get (cdr old) 'display)))
                             (org-yt-get-image (format "http://img.youtube.com/vi/%s/0.jpg" video-id))))
                   (when image-data
                     (org-image-update-overlay image-data el t t)))))))))

      (advice-add #'org-display-inline-images :after #'org-yt-display-inline-images)  
    #+end_src
    #+results:
    - to show or not previews (which are too big right now ) :
    #+begin_src elisp 
      (org-toggle-inline-images)
    #+end_src
    #+begin_images
    #+ATTR_ORG: :width 200/250/300/400/500/600
    [[yt:W6e1TctNyw8]]
    #+ATTR_ORG: :width 200/250/300/400/500/600
    [[yt:aiw8CTK2o_Q]]

    #+ATTR_ORG: :width 200/250/300/400/500/600
    [[yt:j_t8CdCpFXA]]
    #+end_images
    
** basic local
  :PROPERTIES:
  :headers-args: :tangle yes :results output
  :END:
  #+begin_src elisp :tangle no
    (load-file "~/cloud/.personal/dotfiles/emacsPackages/persp-mode/persp-mode.el") 
    (setq persp-autokill-buffer-on-remove 'kill-weak)
  #+end_src

  #+RESULTS:
  : kill-weak

   :PROPERTIES:
   :headers-args: :tangle no
   :END:
   #+begin_src elisp
     ;; Integrate `ivy'
     (with-eval-after-load "ivy"
       (add-hook 'ivy-ignore-buffers
                 #'(lambda (b)
                     (when persp-mode
                       (let ((persp (get-current-persp)))
                         (if persp
                             (not (persp-contain-buffer-p b persp))
                           nil)))))

       (setq ivy-sort-functions-alist
             (append ivy-sort-functions-alist
                     '((persp-kill-buffer   . nil)
                       (persp-remove-buffer . nil)
                       (persp-add-buffer    . nil)
                       (persp-switch        . nil)
                       (persp-window-switch . nil)
                       (persp-frame-switch  . nil)))))
   #+end_src

   #+RESULTS:
   : ((read-file-name-internal . ivy-sort-file-function-default) (internal-complete-buffer) (ivy-completion-in-region) (counsel-git-grep-function) (Man-goto-section) (org-refile) (t . ivy-string<) (persp-kill-buffer) (persp-remove-buffer) (persp-add-buffer) (persp-switch) (persp-window-switch) (persp-frame-switch))


